Pandas deals with below data structures
>Series
>Data Frames
>Panel
The above structures are build on top of numpy,which is fast
The best way to think of these data structures is that the higher dimensional data structure is a container of its lower dimensional data structure. For example, DataFrame is a container of Series, Panel is a container of DataFrame.

Data Structure	Dimensions	Description
Series	           1	     1D labeled homogeneous array, sizeimmutable.
Data Frames	       2	     General 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns.
Panel	           3	     General 3D labeled, size

Series is a one-dimensional array like structure with homogeneous data. For example, the following series is a collection of integers 10, 23, 56, …
>Homogeneous data
>Size Immutable
>Values of Data Mutable

A pandas Series can be created using the following constructor −
pandas.Series( data, index, dtype, copy)

###### Create an Empty Series

In [2]:
import pandas as pd

In [148]:
s = pd.Series()
s

Series([], dtype: float64)

###### Create a Series from ndarray
If data is an ndarray, then index passed must be of the same length. If no index is passed, then by default index will be range(n) where n is array length, i.e., [0,1,2,3…. range(len(array))-1].

In [3]:
import numpy as np
data = np.array(['a','b','c','d'])
ser1 = pd.Series(data)
print(ser1)

0    a
1    b
2    c
3    d
dtype: object

In [15]:
data = np.array(['a','b','c','d'])
ser2 = pd.Series(data,index=[101,102,103,104]) #manually passing the index of the array
ser2

101    a
102    b
103    c
104    d
dtype: object

###### Create a series from Dictionary

In [18]:
dic_a = {"a":1,"b":2,"c":3,"d":4}
ser3 = pd.Series(dic_a)
ser3

a    1
b    2
c    3
d    4
dtype: int64

In [59]:
ser4 = pd.Series(dic_a,index=["p","q","r","a"])
ser4

p    NaN
q    NaN
r    NaN
a    1.0
dtype: float64

In [63]:
ser4[np.isnan(ser4)] #numpy has isnan function to identify Not a Number values

p   NaN
q   NaN
r   NaN
dtype: float64

###### Create a Series from Scalar
If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [24]:
ser5 = pd.Series(5,index=[0,1])
ser5

0    5
1    5
dtype: int64

###### Accessing Data from Series with Positions

In [27]:
ser3

a    1
b    2
c    3
d    4
dtype: int64

In [30]:
ser3[0] #retrieve the first element

1

In [40]:
ser3[:3]# retrieve the first three elements from the series

a    1
b    2
c    3
dtype: int64

In [41]:
ser3[:-3]

a    1
dtype: int64

In [39]:
ser3[-3:]

b    2
c    3
d    4
dtype: int64

###### Retrieve Data Using Label (Index)

In [42]:
ser5 = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
ser5

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [51]:
#retrieve a single element
print(ser5['a'])

1

In [54]:
#fetching multiple element 
print(ser5[['a','c','d','e']])

a    1
c    3
d    4
e    5
dtype: int64

In [66]:
ser5.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

###### More Querying Series

In [82]:
pd.Series.iloc?

In [71]:
ser5.iloc[1]#Purely integer-location based indexing for selection by position.

2

In [72]:
ser5.iloc[[1,2,3]]

b    2
c    3
d    4
dtype: int64

In [83]:
pd.Series.loc?

In [88]:
ser5.loc["a"]

1

In [89]:
ser5.loc[["a","b"]]

a    1
b    2
dtype: int64

In [93]:
ser6=pd.Series([1,2,3,4,5,6]) #example of summation

In [94]:
np.sum(ser6)

21

In [95]:
ser6.sum()

21

In [96]:
ser6.mean()

3.5

In [102]:
#fetching the first 5 entry 
ser7 = pd.Series([9,8,7,6,5,34,2,98])
ser7.head(7) 
ser7.tail(2)

SyntaxError: invalid syntax (<ipython-input-102-985d1bd7186d>, line 3)

In [104]:
len(ser7) #total elements in the series

8

In [114]:
%%timeit -n 100
summary =0 
for i in ser7:
  summary +=i

15.5 µs ± 842 ns per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [115]:
%%timeit -n 100
summary = ser7.sum()

94.1 µs ± 10 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [116]:
%%timeit -n 100
summary = np.sum(ser7)

117 µs ± 27 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [118]:
ser7+2

0     11
1     10
2      9
3      8
4      7
5     36
6      4
7    100
dtype: int64

In [132]:
for label,val in ser7.iteritems():
    ser7.set_value(label, val+2)
    print(val,label)

15 0
14 1
13 2
12 3
11 4
40 5
8 6
104 7

/Users/gauravsoni/PycharmProjects/enviornments_python/py_dyango/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

In [ ]:
ser7

In [35]:
ser8 = pd.Series(np.random.randint(0,1000,10000))
for label, value in ser8.iteritems():
    ser8.loc[label]= value+2

In [13]:
s = pd.Series([1, 2, 3])
s.loc['Animal'] = 'Bears'
s

0             1
1             2
2             3
Animal    Bears
dtype: object

In [15]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [17]:
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [19]:
all_countries = original_sports.append(cricket_loving_countries)
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [21]:
all_countries["Golf"]

'Scotland'

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

Features of DataFrame
>Potentially columns are of different types
>Size – Mutable
>Labeled axes (rows and columns)
>Can Perform Arithmetic operations on rows and columns

pandas.DataFrame( data, index, columns, dtype, copy)

Create DataFrame
A pandas DataFrame can be created using various inputs like −

Lists
dict
Series
Numpy ndarrays
Another DataFrame

###### Creation of an empty Dataframe

In [25]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

###### Create a DataFrame from Lists

In [29]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [30]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [32]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print(df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

###### Create a DataFrame from Dict of ndarrays / Lists

In [39]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

   Age   Name
0   28    Tom
1   34   Jack
2   29  Steve
3   42  Ricky

In [41]:
df1 = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print(df1)

       Age   Name
rank1   28    Tom
rank2   34   Jack
rank3   29  Steve
rank4   42  Ricky

###### Create a DataFrame from List of Dicts

In [43]:
dict1 = {"a":1,"b":2}
dict2 = {"c":3,"b":4,"a":5}
list_of_dict = [dict1,dict2]
df2 = pd.DataFrame(list_of_dict)
print(df2)

   a  b    c
0  1  2  NaN
1  5  4  3.0

In [44]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])

#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
print(df1)
print(df2)

        a   b
first   1   2
second  5  10
        a  b1
first   1 NaN
second  5 NaN

###### Create a DataFrame from Dict of Series

In [48]:
ser_1 = pd.Series([1,2,3,4],index = ["A","B","C","D"])
ser_2 = pd.Series([5,4,6,7],index = ["A","B","C","E"])
dict_ser ={"One":ser_1,"Two":ser_2}
df_ser_dict = pd.DataFrame(dict_ser)
print(df_ser_dict)

   One  Two
A  1.0  5.0
B  2.0  4.0
C  3.0  6.0
D  4.0  NaN
E  NaN  7.0

###### Column Selection

In [49]:
df_ser_dict["One"]

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
Name: One, dtype: float64

In [50]:
type(df_ser_dict)

pandas.core.frame.DataFrame

In [53]:
df_ser_dict["Three"] = pd.Series([10,20,30,40],index = ["A","B","C","D"])
df_ser_dict

   One  Two  Three
A  5.0  5.0   10.0
B  4.0  4.0   20.0
C  6.0  6.0   30.0
D  NaN  NaN   40.0
E  7.0  7.0    NaN

In [64]:
df_ser_dict["Four"] =df_ser_dict["One"] +df_ser_dict["Two"]
df_ser_dict

   One  Two  Three  Four
A  5.0  5.0   10.0  10.0
B  4.0  4.0   20.0   8.0
C  6.0  6.0   30.0  12.0
D  NaN  NaN   40.0   NaN
E  7.0  7.0    NaN  14.0

###### Column Deletion

In [65]:
del df_ser_dict["Four"]
df_ser_dict

   One  Two  Three
A  5.0  5.0   10.0
B  4.0  4.0   20.0
C  6.0  6.0   30.0
D  NaN  NaN   40.0
E  7.0  7.0    NaN

In [61]:
df_ser_dict.pop("Four")
df_ser_dict

   One  Two  Three
A  5.0  5.0   10.0
B  4.0  4.0   20.0
C  6.0  6.0   30.0
D  NaN  NaN   40.0
E  7.0  7.0    NaN

###### Row Selection, Addition, and Deletion

In [67]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [71]:
df.loc["a"] #using labels

one    1.0
two    1.0
Name: a, dtype: float64

In [73]:
df.iloc[0] #using internal integer indexes

one    1.0
two    1.0
Name: a, dtype: float64

###### Slice Rows

In [80]:
df[1:3]

   one  two
b  2.0    2
c  3.0    3

###### Addition of Rows

In [81]:
df2 = pd.DataFrame([[2,3],[4,5]],index=['a','c'])
df = df2.append(df2)
print(df)

   0  1
a  2  3
c  4  5
a  2  3
c  4  5

###### Deletion of Rows

In [84]:
# Drop rows with label 0
df = df.drop("a")
df

   0  1
c  4  5
c  4  5

In [83]:
df

   0  1
a  2  3
c  4  5
a  2  3
c  4  5

###### Axes in Series

In [6]:
#Create a series with 100 random numbers
s = pd.Series(np.random.randn(4))
s

0    0.440674
1    2.031416
2    0.824799
3    0.760984
dtype: float64

In [14]:
s.axes #print the labels

[RangeIndex(start=0, stop=4, step=1)]

###### Check whether the Series is empty of not

In [20]:
s_empty = pd.Series()
s_empty.empty

True

In [21]:
s.empty

False

In [22]:
s.values

array([ 0.44067415,  2.03141645,  0.82479912,  0.76098375])

###### Data Frame Basic Functionality

In [23]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)

In [24]:
df.empty

False

In [29]:
df.values

array([[25, 'Tom', 4.23],
       [26, 'James', 3.24],
       [25, 'Ricky', 3.98],
       [23, 'Vin', 2.56],
       [30, 'Steve', 3.2],
       [29, 'Smith', 4.6],
       [23, 'Jack', 3.8]], dtype=object)

In [30]:
df.T #transpose

           0      1      2     3      4      5     6
Age       25     26     25    23     30     29    23
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [34]:
df.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['Age', 'Name', 'Rating'], dtype='object')]

In [35]:
df.dtypes

Age         int64
Name       object
Rating    float64
dtype: object

In [38]:
df.ndim

2

###### Descritive Statistics

In [39]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
print(df)

    Age    Name  Rating
0    25     Tom    4.23
1    26   James    3.24
2    25   Ricky    3.98
3    23     Vin    2.56
4    30   Steve    3.20
5    29   Smith    4.60
6    23    Jack    3.80
7    34     Lee    3.78
8    40   David    2.98
9    30  Gasper    4.80
10   51  Betina    4.10
11   46  Andres    3.65

In [40]:
#sum()
#Returns the sum of the values for the requested axis. By default, axis is index (axis=0).
df.sum()

Age                                                     382
Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Rating                                                44.92
dtype: object

In [42]:
 df.sum(axis=1) #means across the column

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [43]:
df.mean() #mean

Age       31.833333
Rating     3.743333
dtype: float64

In [44]:
df.std() #standard deviation

Age       9.232682
Rating    0.661628
dtype: float64

In [45]:
df.count()

Age       12
Name      12
Rating    12
dtype: int64

In [46]:
df.min()

Age           23
Name      Andres
Rating      2.56
dtype: object

In [47]:
df.max()

Age        51
Name      Vin
Rating    4.8
dtype: object

In [50]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [51]:
 df.describe(include=['object'])

         Name
count      12
unique     12
top     Smith
freq        1

In [54]:
 df.describe(include='all')

              Age   Name     Rating
count   12.000000     12  12.000000
unique        NaN     12        NaN
top           NaN  Smith        NaN
freq          NaN      1        NaN
mean    31.833333    NaN   3.743333
std      9.232682    NaN   0.661628
min     23.000000    NaN   2.560000
25%     25.000000    NaN   3.230000
50%     29.500000    NaN   3.790000
75%     35.500000    NaN   4.132500
max     51.000000    NaN   4.800000

In [56]:
df["Age"].sum() #Specific column sum

382

###### Function Application

To apply your own or another library’s functions to Pandas objects, you should be aware of the three important methods. The methods have been discussed below. The appropriate method to use depends on whether your function expects to operate on an entire DataFrame, row- or column-wise, or element wise.

Table wise Function Application: pipe()
Row or Column Wise Function Application: apply()
Element wise Function Application: applymap()

###### Table-wise Function Application

In [62]:
#Adder function to all two elements and return sum 

def adder(ele1,ele2):
    return ele1+ele2

df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0  0.493914 -0.483702 -0.902863
1  0.721215 -1.087901 -0.125857
2 -0.412918 -0.324105 -0.521475
3  0.719271 -1.013513  0.657654
4 -1.125189  0.419691  1.958703

In [63]:
df.pipe(adder,2)

       col1      col2      col3
0  2.493914  1.516298  1.097137
1  2.721215  0.912099  1.874143
2  1.587082  1.675895  1.478525
3  2.719271  0.986487  2.657654
4  0.874811  2.419691  3.958703

###### Row or Column Wise Function Application

In [64]:
df.apply(np.mean,axis=1)

0   -0.297550
1   -0.164181
2   -0.419499
3    0.121138
4    0.417735
dtype: float64

In [65]:
df.apply(lambda x: x.max() - x.min())

col1    1.846404
col2    1.507592
col3    2.861566
dtype: float64

###### Element Wise Function Application

In [66]:
df

       col1      col2      col3
0  0.493914 -0.483702 -0.902863
1  0.721215 -1.087901 -0.125857
2 -0.412918 -0.324105 -0.521475
3  0.719271 -1.013513  0.657654
4 -1.125189  0.419691  1.958703

In [71]:
df['col1'].map(lambda x:x*100)

0     49.391398
1     72.121467
2    -41.291754
3     71.927127
4   -112.518937
Name: col1, dtype: float64

In [74]:
df.applymap(lambda x:x*100)

         col1        col2        col3
0   49.391398  -48.370161  -90.286329
1   72.121467 -108.790114  -12.585715
2  -41.291754  -32.410540  -52.147486
3   71.927127 -101.351282   65.765411
4 -112.518937   41.969104  195.870276

##### Reindexing

Reindexing changes the row labels and column labels of a DataFrame. To reindex means to conform the data to match a given set of labels along a particular axis.

Multiple operations can be accomplished through indexing like −

Reorder the existing data to match a new set of labels.

Insert missing value (NA) markers in label locations where no data for the label existed.

In [85]:
N=20
df = pd.DataFrame({'A':pd.date_range(start='2018-01-01',periods=N,freq='D'),
                   'x': np.linspace(0,stop=N-1,num=N),
                   'y': np.random.rand(N),
                   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
                   'D': np.random.normal(100, 10, size=(N)).tolist()
                  })
df

            A       C           D     x         y
0  2018-01-01    High  103.602417   0.0  0.434678
1  2018-01-02  Medium  109.787618   1.0  0.489785
2  2018-01-03  Medium   98.744734   2.0  0.115455
3  2018-01-04  Medium   95.451995   3.0  0.121441
4  2018-01-05  Medium  110.152518   4.0  0.507783
5  2018-01-06    High   95.143041   5.0  0.162844
6  2018-01-07  Medium   85.122091   6.0  0.445850
7  2018-01-08  Medium  106.378719   7.0  0.849574
8  2018-01-09     Low   99.198900   8.0  0.193220
9  2018-01-10     Low  116.450754   9.0  0.572401
10 2018-01-11  Medium   82.429125  10.0  0.733006
11 2018-01-12    High  107.380969  11.0  0.015999
12 2018-01-13    High   96.915111  12.0  0.536475
13 2018-01-14  Medium  100.987752  13.0  0.773485
14 2018-01-15    High  103.124568  14.0  0.489884
15 2018-01-16     Low   99.458508  15.0  0.279803
16 2018-01-17  Medium  102.474825  16.0  0.266439
17 2018-01-18  Medium   93.358663  17.0  0.005120
18 2018-01-19    High   91.043178  18.0  0.305793
19 2018-01-20    High  110.502766  19.0  0.116606

In [86]:
#reindex the DataFrame
df_reindexed = df.reindex(index=[0,2,5], columns=['A', 'C', 'B'])
df_reindexed

           A       C   B
0 2018-01-01    High NaN
2 2018-01-03  Medium NaN
5 2018-01-06    High NaN

###### Reindex to Align with Other Objects

In [90]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df1

       col1      col2      col3
0 -0.575278 -1.695848  1.247741
1 -1.366547  0.679367  0.846450
2 -1.576347 -0.346975 -1.027041
3 -1.001655 -0.628784  0.450568
4 -3.290561 -0.185201  0.197816
5  0.567322  2.172653  0.176777
6  1.527523  1.587601 -0.563538
7  0.051864  0.206869 -0.560774
8 -0.649811  1.919116  0.905085
9  0.333283 -0.521496 -0.407803

In [91]:
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])
df2

       col1      col2      col3
0  1.940531  0.528489 -2.430455
1 -2.140650 -0.478884  0.400068
2  1.761771  0.030728  1.355829
3  0.156906  0.569534  1.175403
4 -0.496615  0.287789  0.965530
5 -0.242580  0.122098  1.442897
6 -1.069227 -0.331530  1.325049

In [93]:
df1 = df1.reindex_like(df2) #this will reindex same like df2
df1

       col1      col2      col3
0 -0.575278 -1.695848  1.247741
1 -1.366547  0.679367  0.846450
2 -1.576347 -0.346975 -1.027041
3 -1.001655 -0.628784  0.450568
4 -3.290561 -0.185201  0.197816
5  0.567322  2.172653  0.176777
6  1.527523  1.587601 -0.563538
7  0.051864  0.206869 -0.560774
8 -0.649811  1.919116  0.905085
9  0.333283 -0.521496 -0.407803

###### Filling while ReIndexing

reindex() takes an optional parameter method which is a filling method with values as follows −

pad/ffill − Fill values forward

bfill/backfill − Fill values backward

nearest − Fill from the nearest index values

In [96]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=["Col1","Col2","Col3"])
df1

       Col1      Col2      Col3
0 -0.150475 -1.192226 -0.254180
1  0.269183  1.246765  0.644076
2  1.296085 -0.164266  1.835865
3 -0.083409  1.077585 -0.709885
4  0.929182  1.867479  0.978862
5  0.334389  1.323138 -0.061946

In [97]:
df2 = pd.DataFrame(np.random.randn(2,3),columns=["Col1","Col2","Col3"])
df2

       Col1      Col2      Col3
0  0.024841  0.928834 -1.112205
1 -0.464481 -2.188376 -0.132130

In [98]:
df2.reindex_like(df1) #Padding Nan

       Col1      Col2      Col3
0  0.024841  0.928834 -1.112205
1 -0.464481 -2.188376 -0.132130
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [99]:
#Now fill index with the previous values
print ("Data Frame with Forward Fill:")
df2.reindex_like(df1,method='ffill')

Data Frame with Forward Fill:

       Col1      Col2      Col3
0  0.024841  0.928834 -1.112205
1 -0.464481 -2.188376 -0.132130
2 -0.464481 -2.188376 -0.132130
3 -0.464481 -2.188376 -0.132130
4 -0.464481 -2.188376 -0.132130
5 -0.464481 -2.188376 -0.132130

In [101]:
df2.reindex_like(df1,method='nearest')

       Col1      Col2      Col3
0  0.024841  0.928834 -1.112205
1 -0.464481 -2.188376 -0.132130
2 -0.464481 -2.188376 -0.132130
3 -0.464481 -2.188376 -0.132130
4 -0.464481 -2.188376 -0.132130
5 -0.464481 -2.188376 -0.132130

###### Limits on Filling while Reindexing

The limit argument provides additional control over filling while reindexing. 
Limit specifies the maximum count of consecutive matches. Let us consider the following example to understand the same

In [102]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])

# Padding NAN's
print(df2.reindex_like(df1))

       col1      col2      col3
0 -0.258364 -0.258759 -0.926222
1 -1.979796  0.152483  0.486317
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [103]:
print ("Data Frame with Forward Fill limiting to 1:")
df2.reindex_like(df1,method='ffill',limit=1)

Data Frame with Forward Fill limiting to 1:

       col1      col2      col3
0 -0.258364 -0.258759 -0.926222
1 -1.979796  0.152483  0.486317
2 -1.979796  0.152483  0.486317
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

###### Renaming

The rename() method allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.
Let us consider the following example to understand this −
The rename() method provides an inplace named parameter, which by default is False and copies the underlying data. Pass inplace=True to rename the data in place.

In [104]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df1

       col1      col2      col3
0  0.231639  0.561682 -0.391287
1  1.083753 -0.541128  1.046602
2 -1.067158 -0.912831 -0.694143
3  1.492825  0.585189  0.494829
4 -1.576168 -0.013189 -0.975189
5 -0.867104  0.231078  0.283738

In [105]:
print ("After renaming the rows and columns:")
df1.rename(columns={'col1' : 'c1', 'col2' : 'c2'},
index = {0 : 'apple', 1 : 'banana', 2 : 'durian'})

After renaming the rows and columns:

              c1        c2      col3
apple   0.231639  0.561682 -0.391287
banana  1.083753 -0.541128  1.046602
durian -1.067158 -0.912831 -0.694143
3       1.492825  0.585189  0.494829
4      -1.576168 -0.013189 -0.975189
5      -0.867104  0.231078  0.283738

###### Iterating Over Data Frames

It depends on which type of Structure we are iterating ,for Series its like a normal array
,iterating over the values whereas for the Data Frames and Panels it should more like Dict ,iterating over the Keys()

basic iteration produces 
> Series -> Values
> Data Frame -> Column Labels
> Panels -> Item Labels

In [109]:
N=20

df = pd.DataFrame({
    'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
    'x': np.linspace(0,stop=N-1,num=N),
    'y': np.random.rand(N),
    'C': np.random.choice(['Low','Medium','High'],N).tolist(),
    'D': np.random.normal(100, 10, size=(N)).tolist()
    })

for col in df:
   print(col)

A
C
D
x
y

In [110]:
df

            A       C           D     x         y
0  2016-01-01  Medium  112.390723   0.0  0.058003
1  2016-01-02    High  124.578085   1.0  0.777867
2  2016-01-03     Low   97.391540   2.0  0.880084
3  2016-01-04     Low  103.267879   3.0  0.984675
4  2016-01-05     Low  103.475933   4.0  0.557616
5  2016-01-06  Medium  118.757065   5.0  0.228248
6  2016-01-07  Medium  100.860003   6.0  0.822674
7  2016-01-08    High  124.656921   7.0  0.994446
8  2016-01-09    High  103.514716   8.0  0.242244
9  2016-01-10  Medium  119.700671   9.0  0.676095
10 2016-01-11    High   96.042569  10.0  0.198072
11 2016-01-12  Medium  112.432115  11.0  0.523768
12 2016-01-13     Low   98.269387  12.0  0.497873
13 2016-01-14     Low  105.700412  13.0  0.871172
14 2016-01-15  Medium  100.900234  14.0  0.306494
15 2016-01-16     Low  110.591867  15.0  0.688249
16 2016-01-17     Low  114.041903  16.0  0.315993
17 2016-01-18  Medium  102.232095  17.0  0.318536
18 2016-01-19    High  108.630007  18.0  0.036374
19 2016-01-20  Medium  106.484473  19.0  0.568439

To iterate over the rows of the DataFrame, we can use the following functions −

iteritems() − to iterate over the (key,value) pairs

iterrows() − iterate over the rows as (index,series) pairs

itertuples() − iterate over the rows as namedtuples

In [108]:
for key,value in df.iteritems():
    print(key,value)

A 0    2016-01-01
1    2016-01-02
2    2016-01-03
3    2016-01-04
4    2016-01-05
5    2016-01-06
6    2016-01-07
7    2016-01-08
8    2016-01-09
9    2016-01-10
10   2016-01-11
11   2016-01-12
12   2016-01-13
13   2016-01-14
14   2016-01-15
15   2016-01-16
16   2016-01-17
17   2016-01-18
18   2016-01-19
19   2016-01-20
Name: A, dtype: datetime64[ns]
C 0     Medium
1     Medium
2        Low
3        Low
4     Medium
5        Low
6        Low
7     Medium
8       High
9     Medium
10    Medium
11       Low
12       Low
13      High
14      High
15    Medium
16      High
17       Low
18    Medium
19    Medium
Name: C, dtype: object
D 0     103.563907
1     102.551733
2     110.304962
3      78.428528
4     100.778299
5     101.063624
6     100.970234
7      87.784435
8      95.222789
9     102.933105
10    117.687712
11     84.073587
12     85.662984
13     92.125109
14    105.219225
15    118.511285
16    105.431455
17     97.001909
18    105.252406
19     89.146675
Name: D, dtype: float64
x 0      0.0
1      1.0
2      2.0
3      3.0
4      4.0
5      5.0
6      6.0
7      7.0
8      8.0
9      9.0
10    10.0
11    11.0
12    12.0
13    13.0
14    14.0
15    15.0
16    16.0
17    17.0
18    18.0
19    19.0
Name: x, dtype: float64
y 0     0.987869
1     0.057879
2     0.697223
3     0.812484
4     0.293439
5     0.643180
6     0.227889
7     0.512848
8     0.333180
9     0.114542
10    0.248306
11    0.497159
12    0.149214
13    0.385553
14    0.855092
15    0.072565
16    0.744894
17    0.761579
18    0.413587
19    0.522260
Name: y, dtype: float64

In [111]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(4,3),columns = ['col1','col2','col3'])
df

       col1      col2      col3
0  0.861937  0.210764 -0.382794
1  0.555105  0.061689 -0.138960
2  0.596954 -1.086415 -0.369251
3 -0.704417 -0.566222  0.351665

In [112]:
for row_index,row in df.iterrows():
   print(row_index,row)

0 col1    0.861937
col2    0.210764
col3   -0.382794
Name: 0, dtype: float64
1 col1    0.555105
col2    0.061689
col3   -0.138960
Name: 1, dtype: float64
2 col1    0.596954
col2   -1.086415
col3   -0.369251
Name: 2, dtype: float64
3 col1   -0.704417
col2   -0.566222
col3    0.351665
Name: 3, dtype: float64

Do not try to modify any object while iterating. Iterating is meant for reading and the iterator returns a copy of the original object (a view), thus the changes will not reflect on the original object.

In [113]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(4,3),columns = ['col1','col2','col3'])

for index, row in df.iterrows():
   row['a'] = 10
df

       col1      col2      col3
0 -1.998222 -0.899571  0.669525
1 -0.568209 -1.340235  0.219035
2  0.525035 -0.155053 -0.152634
3  1.577683  0.057825 -0.784846

###### Sorting

There are two kinds of sorting available in Pandas. They are −

By label
By Actual Value

In [115]:
unsorted_df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col2','col1'])
unsorted_df

       col2      col1
1 -0.468901  0.423039
4  0.829409  1.031669
6 -0.687739  1.168075
2 -0.226552 -0.259130
3  0.027615 -0.761794
5  0.906681 -0.287059
9 -1.247282  0.612827
8 -0.762738  1.674780
0  0.934068 -0.654495
7 -0.759093 -0.924488

In [117]:
unsorted_df.sort_index() #aort by index

       col2      col1
0  0.934068 -0.654495
1 -0.468901  0.423039
2 -0.226552 -0.259130
3  0.027615 -0.761794
4  0.829409  1.031669
5  0.906681 -0.287059
6 -0.687739  1.168075
7 -0.759093 -0.924488
8 -0.762738  1.674780
9 -1.247282  0.612827

In [118]:
unsorted_df.sort_index(ascending=False)

       col2      col1
9 -1.247282  0.612827
8 -0.762738  1.674780
7 -0.759093 -0.924488
6 -0.687739  1.168075
5  0.906681 -0.287059
4  0.829409  1.031669
3  0.027615 -0.761794
2 -0.226552 -0.259130
1 -0.468901  0.423039
0  0.934068 -0.654495

In [121]:
unsorted_df.sort_index(axis=1)

       col2      col1
1 -0.468901  0.423039
4  0.829409  1.031669
6 -0.687739  1.168075
2 -0.226552 -0.259130
3  0.027615 -0.761794
5  0.906681 -0.287059
9 -1.247282  0.612827
8 -0.762738  1.674780
0  0.934068 -0.654495
7 -0.759093 -0.924488

In [122]:
unsorted_df.sort_values(by='col1',ascending=False)

       col2      col1
8 -0.762738  1.674780
6 -0.687739  1.168075
4  0.829409  1.031669
9 -1.247282  0.612827
1 -0.468901  0.423039
2 -0.226552 -0.259130
5  0.906681 -0.287059
0  0.934068 -0.654495
3  0.027615 -0.761794
7 -0.759093 -0.924488

In [124]:
unsorted_df.sort_values(by=['col2','col1'],ascending=False)

       col2      col1
0  0.934068 -0.654495
5  0.906681 -0.287059
4  0.829409  1.031669
3  0.027615 -0.761794
2 -0.226552 -0.259130
1 -0.468901  0.423039
6 -0.687739  1.168075
7 -0.759093 -0.924488
8 -0.762738  1.674780
9 -1.247282  0.612827

Sorting Algorithm
sort_values() provides a provision to choose the algorithm from mergesort, heapsort and quicksort. Mergesort is the only stable algorithm.

In [125]:
unsorted_df.sort_values(by=['col1'],ascending=False,kind="heapsort")

       col2      col1
8 -0.762738  1.674780
6 -0.687739  1.168075
4  0.829409  1.031669
9 -1.247282  0.612827
1 -0.468901  0.423039
2 -0.226552 -0.259130
5  0.906681 -0.287059
0  0.934068 -0.654495
3  0.027615 -0.761794
7 -0.759093 -0.924488

###### Python Working with Text Data

In [127]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])
s

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [128]:
s.str.lower()

0             tom
1    william rick
2            john
3         alber@t
4             NaN
5            1234
6      stevesmith
dtype: object

In [130]:
s.str.upper()

0             TOM
1    WILLIAM RICK
2            JOHN
3         ALBER@T
4             NaN
5            1234
6      STEVESMITH
dtype: object

In [133]:
s.str.len()

0     3.0
1    12.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [134]:
s = pd.Series(['Tom', ' William Rick ', ' John', 'Alber@t ', np.nan, '1234','SteveSmith'])
s

0               Tom
1     William Rick
2              John
3          Alber@t
4               NaN
5              1234
6        SteveSmith
dtype: object

In [135]:
s.str.strip()

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [136]:
s.str.split(' ')

0                  [Tom]
1    [, William, Rick, ]
2               [, John]
3            [Alber@t, ]
4                    NaN
5                 [1234]
6           [SteveSmith]
dtype: object

In [137]:
s.str.cat(sep='_')

'Tom_ William Rick _ John_Alber@t _1234_SteveSmith'

In [138]:
s.str.get_dummies()

    John   William Rick   1234  Alber@t   SteveSmith  Tom
0      0               0     0         0           0    1
1      0               1     0         0           0    0
2      1               0     0         0           0    0
3      0               0     0         1           0    0
4      0               0     0         0           0    0
5      0               0     1         0           0    0
6      0               0     0         0           1    0

In [139]:
s.str.contains(' ')

0    False
1     True
2     True
3     True
4      NaN
5    False
6    False
dtype: object

In [140]:
s.str.replace('@','$')

0               Tom
1     William Rick
2              John
3          Alber$t
4               NaN
5              1234
6        SteveSmith
dtype: object

In [141]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])
s

0             Tom
1     William Rick
2             John
3          Alber@t
dtype: object

In [142]:
s.str.repeat(2)

0                      Tom Tom
1     William Rick William Rick
2                      JohnJohn
3                Alber@tAlber@t
dtype: object

In [143]:
s.str.count('m')

0    1
1    1
2    0
3    0
dtype: int64

In [144]:
s.str. startswith ('T')

0     True
1    False
2    False
3    False
dtype: bool

In [145]:
s.str.endswith('t')

0    False
1    False
2    False
3     True
dtype: bool

In [146]:
s.str.isnumeric()

0    False
1    False
2    False
3    False
dtype: bool

###### Option and Customizations

Pandas provide API to customize some aspects of its behavior, display is being mostly used.

The API is composed of five relevant functions. They are −

get_option()
set_option()
reset_option()
describe_option()
option_context()

In [149]:
pd.get_option("display.max_rows")

60

In [150]:
pd.get_option("display.max_columns")

20

In [152]:
pd.set_option("display.max_rows",80)
pd.get_option("display.max_rows")

80

In [154]:
pd.reset_option("display.max_rows")
pd.get_option("display.max_rows")

60

In [155]:
pd.describe_option("display.max_rows")

display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 60]

In [156]:
with pd.option_context("display.max_rows",10):
   print(pd.get_option("display.max_rows"))
   print(pd.get_option("display.max_rows"))

10
10

###### Python Pandas Indexing and Selecting Data

Pandas now supports three types of Multi-axes indexing; the three types are mentioned in the following table −

Indexing	Description
.loc()	Label based
.iloc()	Integer based
.ix()	Both Label and Integer based

.loc()
Pandas provide various methods to have purely label based indexing. When slicing, the start bound is also included. Integers are valid labels, but they refer to the label and not the position.

.loc() has multiple access methods like −

A single scalar label
A list of labels
A slice object
A Boolean array
loc takes two single/list/range operator separated by ','. The first one indicates the row and the second one indicates columns.

In [159]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
a -0.083339  0.138820  0.079960 -0.282652
b -1.118607 -0.703612  0.218146  0.511151
c  0.809473 -1.239862 -0.925935 -1.293519
d -0.010255 -2.296553  0.145456 -0.719004
e  0.122024  0.607071 -0.392022  0.567729
f -0.509541 -0.760530 -0.884589 -0.454341
g  1.390654 -0.769696  0.236159  1.106702
h -0.106443  0.291973  0.007735  0.750824

In [168]:
#select all rows for a specific column
df.loc[:,'A']

a   -0.083339
b   -1.118607
c    0.809473
d   -0.010255
e    0.122024
f   -0.509541
g    1.390654
h   -0.106443
Name: A, dtype: float64

In [169]:
df.loc[['a','b','e'],'A']

a   -0.083339
b   -1.118607
e    0.122024
Name: A, dtype: float64

In [170]:
df.loc[:,['A','C']]

          A         C
a -0.083339  0.079960
b -1.118607  0.218146
c  0.809473 -0.925935
d -0.010255  0.145456
e  0.122024 -0.392022
f -0.509541 -0.884589
g  1.390654  0.236159
h -0.106443  0.007735

In [171]:
df.loc[['a','b','f','h'],['A','C']]

          A         C
a -0.083339  0.079960
b -1.118607  0.218146
f -0.509541 -0.884589
h -0.106443  0.007735

In [172]:
df.loc['a':'d']

          A         B         C         D
a -0.083339  0.138820  0.079960 -0.282652
b -1.118607 -0.703612  0.218146  0.511151
c  0.809473 -1.239862 -0.925935 -1.293519
d -0.010255 -2.296553  0.145456 -0.719004

In [173]:
df.loc['a']>0

A    False
B     True
C     True
D    False
Name: a, dtype: bool

.iloc()
Pandas provide various methods in order to get purely integer based indexing. Like python and numpy, these are 0-based indexing.

The various access methods are as follows −

An Integer
A list of integers
A range of values

In [174]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.008232  0.511604  1.170058  2.423873
1  0.859904  0.113279  1.671012  0.910528
2 -1.226017  0.005601  0.531561 -1.757864
3 -0.065681 -1.169888 -0.754002  1.841099
4  0.365285  1.687752  0.931043  1.002724
5  0.237222  0.441620  2.205738 -0.340090
6 -0.322748 -0.916591  0.717937  1.252078
7  0.502252 -0.440570  0.040516 -1.759054

In [175]:
# select all rows for a specific column
df.iloc[:4]

          A         B         C         D
0 -0.008232  0.511604  1.170058  2.423873
1  0.859904  0.113279  1.671012  0.910528
2 -1.226017  0.005601  0.531561 -1.757864
3 -0.065681 -1.169888 -0.754002  1.841099

In [176]:
df.iloc[1:5, 2:4]

          C         D
1  1.671012  0.910528
2  0.531561 -1.757864
3 -0.754002  1.841099
4  0.931043  1.002724

In [177]:
df.iloc[[1, 3, 5], [1, 3]]

          B         D
1  0.113279  0.910528
3 -1.169888  1.841099
5  0.441620 -0.340090

In [178]:
df.iloc[1:3, :]

          A         B         C         D
1  0.859904  0.113279  1.671012  0.910528
2 -1.226017  0.005601  0.531561 -1.757864

.ix()
Besides pure label based and integer based, Pandas provides a hybrid method for selections and subsetting the object using the .ix() operator.

In [179]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.021700  1.354385 -0.186456 -0.074127
1 -0.465304 -1.944454  0.574321  0.778045
2 -0.617448  1.759901  0.399381 -1.495411
3  1.264301  0.762255 -0.798330  1.081836
4  0.849624 -1.747672 -0.869475 -0.255048
5 -1.010855  0.858901 -0.170270  0.330103
6  1.298785  0.141722  0.090431 -0.982316
7  0.558290 -2.102273  0.407831 -0.330305

In [180]:
# Integer slicing
df.ix[:4]

/Users/gauravsoni/PycharmProjects/enviornments_python/py_dyango/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

          A         B         C         D
0  0.021700  1.354385 -0.186456 -0.074127
1 -0.465304 -1.944454  0.574321  0.778045
2 -0.617448  1.759901  0.399381 -1.495411
3  1.264301  0.762255 -0.798330  1.081836
4  0.849624 -1.747672 -0.869475 -0.255048

In [181]:
df[['A','B']]

          A         B
0  0.021700  1.354385
1 -0.465304 -1.944454
2 -0.617448  1.759901
3  1.264301  0.762255
4  0.849624 -1.747672
5 -1.010855  0.858901
6  1.298785  0.141722
7  0.558290 -2.102273

In [182]:
df[2:2]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [191]:
df[1:1]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

###### Statistical Functions

Statistical methods help in the understanding and analyzing the behavior of data. We will now learn a few statistical functions, which we can apply on Pandas objects.

In [6]:
s = pd.Series([1,2,3,4,5,4])
s

0    1
1    2
2    3
3    4
4    5
5    4
dtype: int64

In [7]:
s.pct_change()

0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.250000
5   -0.200000
dtype: float64

In [8]:
s = pd.Series(np.random.np.random.randn(5), index=list('abcde'))
s

a   -1.875136
b   -0.064175
c   -0.675522
d    0.383630
e    0.234797
dtype: float64

In [14]:
s.rank(ascending=False)

a    5.0
b    3.0
c    4.0
d    1.0
e    2.0
dtype: float64

###### Pandas Windowing Functions

.rolling() Function
This function can be applied on a series of data. Specify the window=n argument and apply the appropriate statistical function on top of it.

In [24]:
df = pd.DataFrame(np.random.randint(10,size=(10,4)),
index = pd.date_range('1/1/2000', periods=10),
columns = ['A', 'B', 'C', 'D'])
df

            A  B  C  D
2000-01-01  6  4  1  8
2000-01-02  8  9  3  2
2000-01-03  7  9  6  0
2000-01-04  4  4  7  9
2000-01-05  5  8  4  0
2000-01-06  5  0  4  7
2000-01-07  1  7  7  3
2000-01-08  0  5  3  6
2000-01-09  8  3  6  6
2000-01-10  5  0  1  5

In [28]:
df.rolling(window=3).mean()

                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03  7.000000  7.333333  3.333333  3.333333
2000-01-04  6.333333  7.333333  5.333333  3.666667
2000-01-05  5.333333  7.000000  5.666667  3.000000
2000-01-06  4.666667  4.000000  5.000000  5.333333
2000-01-07  3.666667  5.000000  5.000000  3.333333
2000-01-08  2.000000  4.000000  4.666667  5.333333
2000-01-09  3.000000  5.000000  5.333333  5.000000
2000-01-10  4.333333  2.666667  3.333333  5.666667

In [27]:
df.expanding(min_periods=2).sum()

               A     B     C     D
2000-01-01   NaN   NaN   NaN   NaN
2000-01-02  14.0  13.0   4.0  10.0
2000-01-03  21.0  22.0  10.0  10.0
2000-01-04  25.0  26.0  17.0  19.0
2000-01-05  30.0  34.0  21.0  19.0
2000-01-06  35.0  34.0  25.0  26.0
2000-01-07  36.0  41.0  32.0  29.0
2000-01-08  36.0  46.0  35.0  35.0
2000-01-09  44.0  49.0  41.0  41.0
2000-01-10  49.0  49.0  42.0  46.0

In [34]:
df.rolling(window=3,min_periods=2).aggregate(np.sum)

               A     B     C     D
2000-01-01   NaN   NaN   NaN   NaN
2000-01-02  14.0  13.0   4.0  10.0
2000-01-03  21.0  22.0  10.0  10.0
2000-01-04  19.0  22.0  16.0  11.0
2000-01-05  16.0  21.0  17.0   9.0
2000-01-06  14.0  12.0  15.0  16.0
2000-01-07  11.0  15.0  15.0  10.0
2000-01-08   6.0  12.0  14.0  16.0
2000-01-09   9.0  15.0  16.0  15.0
2000-01-10  13.0   8.0  10.0  17.0

In [35]:
r=df.rolling(window =3,min_periods=1)
r['A'].aggregate(np.sum)

2000-01-01     6.0
2000-01-02    14.0
2000-01-03    21.0
2000-01-04    19.0
2000-01-05    16.0
2000-01-06    14.0
2000-01-07    11.0
2000-01-08     6.0
2000-01-09     9.0
2000-01-10    13.0
Freq: D, Name: A, dtype: float64

In [36]:
r['A'].aggregate([np.sum,np.mean])

             sum      mean
2000-01-01   6.0  6.000000
2000-01-02  14.0  7.000000
2000-01-03  21.0  7.000000
2000-01-04  19.0  6.333333
2000-01-05  16.0  5.333333
2000-01-06  14.0  4.666667
2000-01-07  11.0  3.666667
2000-01-08   6.0  2.000000
2000-01-09   9.0  3.000000
2000-01-10  13.0  4.333333

In [41]:
r.aggregate({'A' : np.sum,'B' : np.mean}) #Apply Different Functions to Different Columns of a Dataframe

               A         B
2000-01-01   6.0  4.000000
2000-01-02  14.0  6.500000
2000-01-03  21.0  7.333333
2000-01-04  19.0  7.333333
2000-01-05  16.0  7.000000
2000-01-06  14.0  4.000000
2000-01-07  11.0  5.000000
2000-01-08   6.0  4.000000
2000-01-09   9.0  5.000000
2000-01-10  13.0  2.666667

In [44]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])
df

        one       two     three
a  0.353747 -0.265619 -1.391462
c  1.324820  0.468355  0.295216
e -0.009810 -0.205875  0.043073
f -0.794370  0.170500 -0.782696
h  0.211491 -0.657662 -0.675846

In [45]:
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three
a  0.353747 -0.265619 -1.391462
b       NaN       NaN       NaN
c  1.324820  0.468355  0.295216
d       NaN       NaN       NaN
e -0.009810 -0.205875  0.043073
f -0.794370  0.170500 -0.782696
g       NaN       NaN       NaN
h  0.211491 -0.657662 -0.675846

In [47]:
print(df['one'].isnull(),df['one'].isnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [48]:
df.fillna(0)

        one       two     three
a  0.353747 -0.265619 -1.391462
b  0.000000  0.000000  0.000000
c  1.324820  0.468355  0.295216
d  0.000000  0.000000  0.000000
e -0.009810 -0.205875  0.043073
f -0.794370  0.170500 -0.782696
g  0.000000  0.000000  0.000000
h  0.211491 -0.657662 -0.675846

In [49]:
df.fillna(method='backfill')

        one       two     three
a  0.353747 -0.265619 -1.391462
b  1.324820  0.468355  0.295216
c  1.324820  0.468355  0.295216
d -0.009810 -0.205875  0.043073
e -0.009810 -0.205875  0.043073
f -0.794370  0.170500 -0.782696
g  0.211491 -0.657662 -0.675846
h  0.211491 -0.657662 -0.675846

In [50]:
df.fillna(method='pad')

        one       two     three
a  0.353747 -0.265619 -1.391462
b  0.353747 -0.265619 -1.391462
c  1.324820  0.468355  0.295216
d  1.324820  0.468355  0.295216
e -0.009810 -0.205875  0.043073
f -0.794370  0.170500 -0.782696
g -0.794370  0.170500 -0.782696
h  0.211491 -0.657662 -0.675846

In [51]:
df.dropna()

        one       two     three
a  0.353747 -0.265619 -1.391462
c  1.324820  0.468355  0.295216
e -0.009810 -0.205875  0.043073
f -0.794370  0.170500 -0.782696
h  0.211491 -0.657662 -0.675846

In [52]:
df

        one       two     three
a  0.353747 -0.265619 -1.391462
b       NaN       NaN       NaN
c  1.324820  0.468355  0.295216
d       NaN       NaN       NaN
e -0.009810 -0.205875  0.043073
f -0.794370  0.170500 -0.782696
g       NaN       NaN       NaN
h  0.211491 -0.657662 -0.675846

In [55]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000],
'two':[1000,0,30,40,50,60]})
df

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

In [56]:
df.replace({1000:11,2000:61})

   one  two
0   10   11
1   20    0
2   30   30
3   40   40
4   50   50
5   61   60

###### Group By

In [59]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

Split Data into Groups
Pandas object can be split into any of their objects. There are multiple ways to split an object like −

obj.groupby('key')
obj.groupby(['key1','key2'])
obj.groupby(key,axis=1)

In [60]:
df.groupby('Team') #object is returned

In [61]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [63]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

###### Iterating through Groups

In [64]:
grouped = df.groupby('Year')

for name,group in grouped:
    print(name)
    print(group)

2014
   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014
2015
    Points  Rank    Team  Year
1      789     2  Riders  2015
3      673     3  Devils  2015
5      812     4   kings  2015
10     804     1  Royals  2015
2016
   Points  Rank    Team  Year
6     756     1   Kings  2016
8     694     2  Riders  2016
2017
    Points  Rank    Team  Year
7      788     1   Kings  2017
11     690     2  Riders  2017

In [65]:
df.groupby('Year').get_group(2014)

   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014

In [71]:
df.groupby('Year')[['Points','Rank']].agg(np.sum)

      Points  Rank
Year
2014    3181    10
2015    3078    10
2016    1450     3
2017    1478     3

In [72]:
df.groupby('Year').agg({'Points' : np.sum,'Rank' : np.mean})

      Points  Rank
Year
2014    3181   2.5
2015    3078   2.5
2016    1450   1.5
2017    1478   1.5

In [73]:
df.groupby('Year').agg(np.size)

      Points  Rank  Team
Year
2014       4     4     4
2015       4     4     4
2016       2     2     2
2017       2     2     2

In [74]:
df.groupby('Year')['Points'].agg([np.sum, np.mean, np.std])

       sum    mean        std
Year
2014  3181  795.25  87.439026
2015  3078  769.50  65.035888
2016  1450  725.00  43.840620
2017  1478  739.00  69.296465

In [76]:
grouped = df.groupby('Team')
score = lambda x: x*10
grouped.transform(score)

    Points  Rank   Year
0     8760    10  20140
1     7890    20  20150
2     8630    20  20140
3     6730    30  20150
4     7410    30  20140
5     8120    40  20150
6     7560    10  20160
7     7880    10  20170
8     6940    20  20160
9     7010    40  20140
10    8040    10  20150
11    6900    20  20170

In [77]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
4      741     3   Kings  2014
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
11     690     2  Riders  2017